"Canonize" = "Canonize";
"ChangeCase" = "Change Case";
"ConvertToASCII" = "Convert to ASCII";
"EducateQuotes" = "Educate Quotes";
"StraightenQuotes" = "Straighten Quotes";
"AddRemoveLineNumbers" = "Add/Remove Line Numbers";
"NumberLines" = "Add/Remove Line Numbers";
"PrefixSuffixLines" = "Prefix/Suffix Lines";
"SortLines" = "Sort Lines";
"ProcessDuplicateLines" = "Process Duplicate Lines";
"ProcessLinesContaining" = "Process Lines Containing";
"ZapGremlins" = "Zap Gremlins";
"AddGremlins" = "Convert Escape Sequences";
"NormalizeLineEndings" = "Normalize Line Endings";
"StripTrailingWhitespace" = "Strip Trailing Whitespace";
"EnsureLineBreakAtEOF" = "Ensure Line Break at EOF";

"Entab" = "Entab";
"Detab" = "Detab";
"SearchReplace" = "Replace All";
"ReplaceAll" = "Replace All";
"DeleteNonMatchingText" = "Delete Non-Matching Text";
"ChangeLineEndings" = "Change Line Endings";
"ChangeTextEncoding" = "Change Text Encoding";
"RunAppleScript" = "Run AppleScript Filter";
"RunUnixScript" = "Run Unix Filter";
"TidyClean" = "Tidy: Clean";
"TidyReflow" = "Tidy: Reflow";
"TidyConvertToXHTML" = "Tidy: Convert To XHTML";
"TidyConvertToXML" = "Tidy: Convert To XML";
"TranslateTextToHTML" = "Translate Text to HTML";
"TranslateHTMLToText" = "Translate HTML to Text";
"FormatMarkup" = "Format Markup";
"OptimizeMarkup" = "Optimize Markup";

"UNIX_SCRIPT_STDERR_TEMPLATE" = "“%@” returned the following error text: %@";
"UNIX_SCRIPT_EXECUTION_ERROR" = "An error (%@) occurred while running the Unix script located at %@";
"UNIX_SCRIPT_NOT_UTF8_TEMPLATE" = "%@: the filter output could not be interpreted as %@";

"SOURCES_BUTTON" = "Choose…";
"OPTIONS_BUTTON" = "Options…";
"NO_SOURCES" = "(nothing selected)";

"INVALID_OPERATIONS_MAIN" = "You cannot use this Text Factory yet.";
"INVALID_OPERATIONS_SUB" = "One or more operations have not been set up.";
"ALL_DISABLED_MAIN" = "All of the operations in this Text Factory are disabled.";
"ALL_DISABLED_SUB" = "Would you like to enable them all and run the factory?";
"ENABLE_ALL_AND_RUN" = "Enable All & Run";

"CANON_CASE_SENSITIVE" = "case sensitive";
"CANON_MATCH_WORDS" = "match words";
"CANON_USE_GREP" = "use Grep";

"SUMMARY_StripTrailingWhitespace" = "Removing white space from the end of lines";
"SUMMARY_EnsureLineBreakAtEOF" = "Ensuring that any non-empty file ends with a line break";

"ADD_GREMLINS_CHAR_ESCAPES" = "character escapes";
"ADD_GREMLINS_HEX_ESCAPES" = "hex escapes";
"ADD_GREMLINS_UNI_ESCAPES" = "Unicode escapes";
"ADD_GREMLINS_ENTITIES" = "HTML entities";
"ADD_GREMLINS_PERCENT_ESCAPES" = "URL percent escapes";
